Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: // group readings in 5 second tumbling windows
zh_cn: // 将读数按5秒的滚动窗口分组

source: // hold timestamp of currently active disable timer
zh_cn: // 用于保存当前活动的停止计时器的时间戳

source: // hostname of JobManager
zh_cn: // JobManager的主机名

source: // how many sensors to query
zh_cn: // 需要查询的传感器数量

source: // how often to query the state
zh_cn: // 状态的查询频率

source: // in a queryable state
zh_cn: // 存入可查询式状态中

source: // increment counter if threshold is exceeded
zh_cn: // 如果超过阈值计数器加一

source: // incrementally compute min and max temperature
zh_cn: // 增量计算最低和最高温度

source: // index of the subtask
zh_cn: // 子任务的索引号

source: // ingest sensor readings with a SensorSource SourceFunction
zh_cn: // 利用SensorSource SourceFunction获取传感器读数

source: // ingest sensor stream
zh_cn: // 读入传感器流

source: // initialize cnt variable
zh_cn: // 初始化cnt变量

source: // initialize keyed state
zh_cn: // 初始化键值分区状态

source: // initialize local variable with state
zh_cn: // 利用算子状态初始化本地的变量

source: // initialize operator state
zh_cn: // 初始化算子状态

source: // jobId of running QueryableStateJob
zh_cn: // 运行QueryableStateJob的jobId

source: // key by sensor id
zh_cn: // 以传感器id为键值进行分区

source: // key by sensor ids
zh_cn: // 以传感器id为键值进行分区

source: // keyBy two connected streams
zh_cn: // 对两个联结后的数据流按键值分区

source: // local count variable
zh_cn: // 本地计数器变量

source: // local variable for the operator high temperature cnt
zh_cn: // 在本地用于存储算子实例高温数目的变量

source: // loop forever
zh_cn: // 死循环

source: // main() defines and executes the DataStream program
zh_cn: // 通过main()方法定义并执行DataStream程序

source: // make sure we process at least 30s without checkpointing
zh_cn: // 确保我们至少可以在不受检查点干扰情况下处理30秒

source: // merge two accumulators and return the result.
zh_cn: // 合并两个累加器并返回合并结果。

source: // monitor stream for readings with freezing temperatures
zh_cn: // 监控冷冻温度数据流

source: // name of transaction file is returned to later identify the transaction
zh_cn: // 返回事务文件名，便于日后识别

source: // no previous temperature defined; just update the last temperature
zh_cn: // 之前的温度还未定义，只需更新前一个温度值

source: // not the first evaluation, emit an update
zh_cn: // 并非首次计算，发出更新

source: // number of restart attempts
zh_cn: // 重启尝试次数

source: // obtain the keyed state handle
zh_cn: // 获取键值分区状态句柄

source: // obtain the state handle
zh_cn: // 获得状态句柄

source: // open socket and writer
zh_cn: // 打开套接字并获得写入器

source: // optional: specify the evictor
zh_cn: // 可选项：指定移除器

source: // optional: specify the trigger
zh_cn: // 可选项：指定触发器

source: // organize readings by sensor id
zh_cn: // 按照传感器id组织数据

source: // output the lowest and highest temperature reading every 5 seconds
zh_cn: // 每5秒输出最低温和最高温读数

source: // override the application-wide value
zh_cn: // 会覆盖应用级别的数值

source: // partition and key the stream on the sensor ID
zh_cn: // 根据传感器ID进行键值分区

source: // path of transaction file is built from current time and task index
zh_cn: // 事务文件的路径由当前时间和任务索引决定

source: // port of JobManager process
zh_cn: // JobManager的端口号

source: // prepare insert and update statements
zh_cn: // 预编译插入及更新语句

source: // print header line of dashboard table
zh_cn: // 打印仪表盘展示表的标题行

source: // print result
zh_cn: // 打印结果

source: // print result stream to standard out
zh_cn: // 将结果流打印到标准输出

source: // print the main output
zh_cn: // 打印主输出

source: // process late readings for 5 additional seconds
zh_cn: // 额外处理5秒的迟到读数

source: // processing-time session windows assigner
zh_cn: // 处理时间会话窗口分配器

source: // processing-time sliding windows assigner
zh_cn: // 处理时间滑动窗口分配器

source: // project to sensor id and temperature
zh_cn: // 仅保留传感器id和温度字段

source: // provide TypeInformation for the map lambda function's return type
zh_cn: // 为map lambda函数的返回类型提供TypeInformation

source: // provide the TypeInformation for the output data type
zh_cn: // 为输出数据类型提供TypeInformation

source: // register initial timer only for first element
zh_cn: // 仅为第一个元素注册初始计时器

source: // register next early firing timer
zh_cn: // 注册下一个用于提前触发的计时器

source: // register state for last temperature
zh_cn: // 注册用于最近一次温度的状态

source: // register state for last timer
zh_cn: // 注册用于前一个计时器的状态

source: // register timer for the window end ctx.registerEventTimeTimer(window.getEnd) firstSeen.update(true)
zh_cn: // 为窗口结束时间注册计时器 ctx.registerEventTimeTimer(window.getEnd) firstSeen.update(true)

source: // remember current timer
zh_cn: // 记住当前的计时器

source: // remove all state; forward switch will be false by default
zh_cn: // 移除所有状态，默认情况下转发开关关闭

source: // remove current timer and register new timer ctx.timerService().deleteEventTimeTimer(curTimerTimestamp) ctx.timerService().registerProcessingTimeTimer(timerTimestamp) disableTimer.update(timerTimestamp)
zh_cn: // 移除当前计时器并注册一个新的 ctx.timerService().deleteProcessingTimeTimer(curTimerTimestamp) ctx.timerService().registerProcessingTimeTimer(timerTimestamp) disableTimer.update(timerTimestamp)

source: // remove previous cnt
zh_cn: // 删除之前的cnt

source: // remove threshold for the sensor
zh_cn: // 删除该传感器的阈值

source: // restore state by adding all longs of the list
zh_cn: // 将状态恢复为列表中的全部long值之和

source: // restores the state of the function from the provided list
zh_cn: // 根据提供的列表恢复函数状态

source: // retrieve and print the freezing alarms side output
zh_cn: // 获取并打印包含冷冻警报的副输出

source: // retrieve late readings
zh_cn: // 获取迟到读数

source: // retrieve the late events from the side output as a stream
zh_cn: // 从副输出中获取迟到事件的数据流

source: // return count as ten parts
zh_cn: // 将计数值作为10个子部分返回

source: // return record timestamp
zh_cn: // 返回记录的时间戳

source: // return room
zh_cn: // 返回房间

source: // returns a snapshot the state of the function as a list
zh_cn: // 以列表形式返回一个函数状态的快照

source: // rounding down by 30 seconds
zh_cn: // 30秒取余

source: // second stream
zh_cn: // 第二条流

source: // send out async queries
zh_cn: // 发出异步查询

source: // serialization schema
zh_cn: // 序列化的Schema

source: // set checkpointing interval to 10 seconds (10000 milliseconds)
zh_cn: // 将检查点的生成周期设置为10秒（10000毫秒）

source: // set disable forward timer
zh_cn: // 设置停止计时器

source: // set mode to at-least-once
zh_cn: // 设置为至少一次模式

source: // set parallelism of the environment
zh_cn: // 设置环境的并行度

source: // set parallelism to 1 because only one thread can write to a socket
zh_cn: // 因为只有一个线程可以写入，所以设置并行度为1

source: // set parameters for insert statement insertStmt.setString(1, r.id) insertStmt.setDouble(2, r.temperature)
zh_cn: // 为插入语句设置参数 insertStmt.setString(1, r.id) insertStmt.setDouble(2, r.temperature)

source: // set parameters for update statement and execute it updateStmt.setDouble(1, r.temperature) updateStmt.setString(2, r.id)
zh_cn: // 设置更新语句的参数并执行 updateStmt.setDouble(1, r.temperature) updateStmt.setString(2, r.id)

source: // set predefined options for spinning disk storage
zh_cn: // 设置针对机械磁盘存储的预定义选项

source: // set processing time timer for now + 1 second
zh_cn: // 以当前时间+1秒设置处理时间计时器

source: // set state backend
zh_cn: // 设置状态后端

source: // set the 2nd field to 42
zh_cn: // 将第二个字段设为42

source: // set the event time characteristic
zh_cn: // 设置为事件时间特性

source: // set the maximum parallelism for this application
zh_cn: // 为应用设置最大并行度

source: // set the maximum parallelism for this operator and
zh_cn: // 为此算子设置最大并行度，

source: // set up the streaming execution environment
zh_cn: // 设置流式执行环境

source: // shortcut for window.(SlidingEventTimeWindow.of(size, slide))
zh_cn: // window.(SlidingEventTimeWindow.of(size, slide))的简写

source: // shortcut for window.(TumblingEventTimeWindows.of(size))
zh_cn: // window.(TumblingEventTimeWindows.of(size))的简写

source: // sliding windows assigner using a shortcut method
zh_cn: // 使用窗口分配器简写方法

source: // slot-sharing group "blue"
zh_cn: // 处理槽共享组"blue"

source: // slot-sharing group "blue" is inherited from d
zh_cn: //从d继承处理槽共享组"blue"

source: // slot-sharing group "green"
zh_cn: // 处理槽共享组"green"

source: // slot-sharing group "green" is inherited from a
zh_cn: // 从a继承处理槽共享组"green"

source: // slot-sharing group "yellow"
zh_cn: // 处理槽共享组"yellow"

source: // snapshot state as list with a single count
zh_cn: // 将一个包含单个数目值的列表作为状态快照

source: // specify the JoinFunction
zh_cn: // 指定JoinFunction

source: // specify the window assigner
zh_cn: // 指定窗口分配器

source: // split count into ten partial counts
zh_cn: // 将计数值分成10个子部分

source: // start a new chain for Map2 and Filter2
zh_cn: // 为Map2和Filter2开启一个新的链接

source: // start master process
zh_cn: // 启动主进程

source: // start worker process (adjust the name to start more than one TM) docker run -d --name flink-taskmanager-1 \
zh_cn: // 启动工作进程（启动多个TM时请选用不同名称） docker run -d --name flink-taskmanager-1 \

source: // state to check if this is the first evaluation of the window or not
zh_cn: // 该状态用于标识是否是第一次对窗口进行计算

source: // store max temperature of the last 10 secs for each sensor
zh_cn: // 将每个传感器每10秒的最高温度

source: // stores temperature of last sensor reading
zh_cn: // 存储最近一次传感器温度读数

source: // stores timestamp of currently active timer
zh_cn: // 存储当前活动计时器的时间戳

source: // submit query and wait for result; this is a synchronous call
zh_cn: // 提交查询并等待结果，该调用是异步的

source: // subtasks are 0-indexed
zh_cn: // 子任务索引号从0开始

source: // sum the second field of the tuple in place
zh_cn: // 滚动计算每个分区内元组第二个字段的总和

source: // switch to enable forwarding
zh_cn: // 转发开关

source: // synchronize data emission and checkpoints
zh_cn: // 使数据发出和检查点同步

source: // target topic
zh_cn: // 目标主题

source: // temperature changed by more than the threshold
zh_cn: // 温度变化超过阈值

source: // temperature decreased; delete current timer ctx.timerService().deleteProcessingTimeTimer(curTimerTimestamp) currentTimer.clear()
zh_cn: // 温度下降，删除当前计时器 ctx.timerService().deleteProcessingTimeTimer(curTimerTimestamp) currentTimer.clear()

source: // temperature increased and we have not set a timer yet
zh_cn: // 温度升高并且还未设置计时器

source: // temperature increased by more than the threshold
zh_cn: // 温度增加超过阈值

source: // the descriptor of the broadcast state
zh_cn: // 广播状态的描述符

source: // the descriptor of the broadcast state private lazy val thresholdStateDescriptor = new MapStateDescriptor[String, Double](
zh_cn: // 广播状态的描述符 private lazy val thresholdStateDescriptor = new MapStateDescriptor[String, Double](

source: // the keyed state handle
zh_cn: // 键值分区状态句柄

source: // the keyed state handle for the last registered timer
zh_cn: // 前一个注册的计时器的键值分区状态句柄

source: // the keyed state handle for the last temperature
zh_cn: // 用于存储最近一次温度的键值分区状态句柄

source: // the map parallelism is set to double the default parallelism
zh_cn: // 设置map的并行度为默认并行度的两倍

source: // the print sink parallelism is fixed to 2
zh_cn: // print数据汇的并行度固定为2

source: // the source runs with the default parallelism
zh_cn: // 数据源以默认并行度运行

source: // the state handle object
zh_cn: // 状态句柄对象

source: // this is a late reading => redirect it to the side output
zh_cn: // 将迟到读数重定向到副输出

source: // threshold exceeded; emit an alert and update the last temperature
zh_cn: // 超出阈值，发出警报并更新前一个温度值

source: // threshold not exceeded; just update the last temperature
zh_cn: // 没有超出阈值，仅更新前一个温度值

source: // timeout requests after 5 seconds
zh_cn: // 请求超时时间为5秒

source: // to register timer callbacks and deal with state
zh_cn: // 使其可以注册计时器回调并处理状态

source: // update histogram
zh_cn: // 更新直方图

source: // update keyed high temp counter
zh_cn: // 更新键值分区的高温计数器

source: // update last temperature
zh_cn: // 更新最近一次的温度

source: // update lastTemp state
zh_cn: // 更新lastTemp状态

source: // update local operator high temp counter
zh_cn: // 更新本地算子实例的高温计数器

source: // update maximum timestamp
zh_cn: // 更新最大时间戳

source: // update operator state with local state opCntState.clear() opCntState.add(opHighTempCnt)
zh_cn: // 利用本地的状态更新算子状态 opCntState.clear() opCntState.add(opHighTempCnt)

source: // update timer timestamp state
zh_cn: //更新计时器时间戳状态

source: // use event time for the application
zh_cn: // 在应用中使用事件时间

source: // wait for results
zh_cn: // 等待结果

source: // wait to send out next queries
zh_cn: // 等待发送下一组查询

source: // write record to standard out
zh_cn: // 将记录写到标准输出

source: // write sensor reading to socket writer.println(value.toString) writer.flush()
zh_cn: // 将传感器读数写入套接字 writer.println(value.toString) writer.flush()

source: // write the sensor readings to a Derby table
zh_cn: // 将传感器读数写入Derby表中

source: // write the sensor readings to a socket
zh_cn: // 将传感器读数写入套接字

source: // write the sensor readings to the standard out via a write-ahead log
zh_cn: // 利用WAL将传感器读数写入标准输出

source: 1 Flink’s batch processing API, the DataSet API, and its operators are separate from their corresponding streaming counterparts.
zh_cn: 1 虽然Flink用于批处理的DataSet API及其算子都独立于对应的流处理部分，

source: 1 ListState and its performance characteristics are discussed in detail in Chapter 7.
zh_cn: 1 有关ListState以及它的性能特征会在第7章详细讨论。

source: 1 We also provide an examples-Java repository with all the examples implemented in Java.
zh_cn: 1 我们还提供了一个examples-Java库，里面的示例都是用Java来完成的。

source: 10 | Chapter 1: Introduction to Stateful Stream Processing
zh_cn: 10 | 第1章：状态化流处理介绍

source: 100 | Chapter 5: The DataStream API (v1.7)
zh_cn: 100 | 第5章：DataStream API （1.7版本）

source: 104 | Chapter 5: The DataStream API (v1.7)
zh_cn: 104 | 第5章：DataStream API （1.7版本）

source: 106 | Chapter 5: The DataStream API (v1.7)
zh_cn: 106 | 第5章：DataStream API （1.7版本）

source: 108 | Chapter 5: The DataStream API (v1.7)
zh_cn: 108 | 第5章：DataStream API （1.7版本）

source: 110 | Chapter 6: Time-Based and Window Operators
zh_cn: 110 | 第6章：基于时间和窗口的算子

source: 112 | Chapter 6: Time-Based and Window Operators
zh_cn: 112 | 第6章：基于时间和窗口的算子

source: 118 | Chapter 6: Time-Based and Window Operators
zh_cn: 118 | 第6章：基于时间和窗口的算子

source: 120 | Chapter 6: Time-Based and Window Operators
zh_cn: 120 | 第6章：基于时间和窗口的算子

source: 122 | Chapter 6: Time-Based and Window Operators
zh_cn: 122 | 第6章：基于时间和窗口的算子

source: 130 | Chapter 6: Time-Based and Window Operators
zh_cn: 130 | 第6章：基于时间和窗口的算子

source: 132 | Chapter 6: Time-Based and Window Operators
zh_cn: 132 | 第6章：基于时间和窗口的算子

source: 14 | Chapter 1: Introduction to Stateful Stream Processing
zh_cn: 14 | 10 | 第1章：状态化流处理介绍

source: 140 | Chapter 6: Time-Based and Window Operators
zh_cn: 140 | 第6章：基于时间和窗口的算子

source: 142 | Chapter 6: Time-Based and Window Operators
zh_cn: 142 | 第6章：基于时间和窗口的算子

source: 146 | Chapter 6: Time-Based and Window Operators
zh_cn: 146 | 第6章：基于时间和窗口的算子

source: 150 | Chapter 6: Time-Based and Window Operators
zh_cn: 150 | 第6章：基于时间和窗口的算子

source: 152 | Chapter 6: Time-Based and Window Operators
zh_cn: 152 | 第6章：基于时间和窗口的算子

source: 154 | Chapter 7: Stateful Operators and Applications
zh_cn: 154 | 第7章：状态化算子和应用

source: 160 | Chapter 7: Stateful Operators and Applications
zh_cn: 160 | 第7章：状态化算子和应用

source: 162 | Chapter 7: Stateful Operators and Applications
zh_cn: 162 | 第7章：状态化算子和应用

source: 168 | Chapter 7: Stateful Operators and Applications
zh_cn: 168 | 第7章：状态化算子和应用

source: 170 | Chapter 7: Stateful Operators and Applications
zh_cn: 170 | 第7章：状态化算子和应用

source: 172 | Chapter 7: Stateful Operators and Applications
zh_cn: 172 | 第7章：状态化算子和应用

source: 174 | Chapter 7: Stateful Operators and Applications
zh_cn: 174 | 第7章：状态化算子和应用

source: 176 | Chapter 7: Stateful Operators and Applications
zh_cn: 176 | 第7章：状态化算子和应用

source: 178 | Chapter 7: Stateful Operators and Applications
zh_cn: 178 | 第7章：状态化算子和应用

source: 18 | Chapter 2: Stream Processing Fundamentals
zh_cn: 18 | 第2章：流处理基础

source: 180 | Chapter 7: Stateful Operators and Applications
zh_cn: 180 | 第7章：状态化算子和应用

source: 182 | Chapter 7: Stateful Operators and Applications
zh_cn: 182 | 第7章：状态化算子和应用

source: 184 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 184 | 第8章：读写外部系统

source: 186 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 186 | 第8章：读写外部系统

source: 190 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 190 | 第8章：读写外部系统

source: 192 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 192 | 第8章：读写外部系统

source: 20 | Chapter 2: Stream Processing Fundamentals
zh_cn: 20 | 第2章：流处理基础

source: 204 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 204 | 第8章：读写外部系统

source: 208 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 208 | 第8章：读写外部系统

source: 210 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 210 | 第8章：读写外部系统

source: 212 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 212 | 第8章：读写外部系统

source: 218 | Chapter 8: Reading from and Writing to External Systems
zh_cn: 218 | 第8章：读写外部系统

source: 22 | Chapter 2: Stream Processing Fundamentals
zh_cn: 22 | 第2章：流处理基础

source: 222 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 222 | 第9章：搭建Flink运行流式应用

source: 230 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 230 | 第9章：搭建Flink运行流式应用

source: 232 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 232 | 第9章：搭建Flink运行流式应用

source: 238 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 238 | 第9章：搭建Flink运行流式应用

source: 240 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 240 | 第9章：搭建Flink运行流式应用

source: 242 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 242 | 第9章：搭建Flink运行流式应用

source: 244 | Chapter 9: Setting Up Flink for Streaming Applications
zh_cn: 244 | 第9章：搭建Flink运行流式应用

source: 246 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 246 | 第10章：Flink和流式应用运维

source: 248 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 248 | 第10章：Flink和流式应用运维

source: 250 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 250 | 第10章：Flink和流式应用运维

source: 252 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 252 | 第10章：Flink和流式应用运维

source: 260 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 260 | 第10章：Flink和流式应用运维

source: 262 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 262 | 第10章：Flink和流式应用运维

source: 270 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 270 | 第10章：Flink和流式应用运维

source: 272 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 272 | 第10章：Flink和流式应用运维

source: 28 | Chapter 2: Stream Processing Fundamentals
zh_cn: 28 | 第2章：流处理基础

source: 280 | Chapter 10: Operating Flink and Streaming Applications
zh_cn: 280 | 第10章：Flink和流式应用运维

source: 282 | Chapter 11: Where to Go from Here?
zh_cn: 282 | 第11章：还有什么？

source: 2PC sink
zh_cn: 2PC数据汇

source: 34 | Chapter 2: Stream Processing Fundamentals
zh_cn: 34 | 第2章：流处理基础

source: 38 | Chapter 3: The Architecture of Apache Flink
zh_cn: 38 | 第3章：Apache Flink架构

source: 4 | Chapter 1: Introduction to Stateful Stream Processing
zh_cn: 4 | 第1章：状态化流处理介绍

source: 46 | Chapter 3: The Architecture of Apache Flink
zh_cn: 46 | 第3章：Apache Flink架构

source: 48 | Chapter 3: The Architecture of Apache Flink
zh_cn: 48 | 第3章：Apache Flink架构

source: 54 | Chapter 3: The Architecture of Apache Flink
zh_cn: 54 | 第3章：Apache Flink架构

source: 60 | Chapter 3: The Architecture of Apache Flink
zh_cn: 60 | 第3章：Apache Flink架构

source: 72 | Chapter 4: Setting Up a Development Environment for Apache Flink
zh_cn: 72 | 第4章：设置Apache Flink开发环境

source: 74 | Chapter 4: Setting Up a Development Environment for Apache Flink
zh_cn: 74 | 设置Apache Flink开发环境

source: 82 | Chapter 5: The DataStream API (v1.7)
zh_cn: 82 | 第5章：DataStream API （1.7版本）

source: 84 | Chapter 5: The DataStream API (v1.7)
zh_cn: 84 | 第5章：DataStream API （1.7版本）

source: 86 | Chapter 5: The DataStream API (v1.7)
zh_cn: 86 | 第5章：DataStream API （1.7版本）

source: 98 | Chapter 5: The DataStream API (v1.7)
zh_cn: 98 | 第5章：DataStream API （1.7版本）

source: <host>.taskmanager.<tm_id>.<job_name>.<task_name>.<subtask_index> Operator
zh_cn: <host>.taskmanager.<tm_id>.<job_name>.<task_name>.<subtask_index> 算子

source: Eager watermarks ensure low latency but provide lower confidence.
zh_cn: 激进的水位线策略保证了低延迟，但随之而来的是低可信度。

source: Figure 1-4 shows a stateful Flink application.
zh_cn: 图1-4展示了一个状态化的Flink应用

source: Figure 1-5 sketches a service architecture composed of event-driven streaming applications.
zh_cn: 图1-5粗略展示了一个由事件驱动型应用组成的服务架构。

source: Figure 2-1 shows a dataflow program that extracts and counts hashtags from an input stream of tweets.
zh_cn: 图2-1展示了一个从推文输入流中提取并计算主题标签数目的dataflow程序，

source: Figure 3-2 visualizes the relationship of TaskManag‐ ers, slots, tasks, and operators.
zh_cn: 图3-2展示了TaskManager、处理槽、任务以及算子之间的关系。

source: Parallelization becomes complicated, since results depend on both the state and incoming events.
zh_cn: 由于结果需要同时依赖状态和到来的事件，状态并行化变得异常复杂。

source: The third and biggest challenge that comes with stateful opera‐ tors is ensuring that state can be recovered and results will be correct even in the presence of failures.
zh_cn: 最后一个也是最大的挑战在于，状态化算子需要保证状态可以恢复，即便出现故障也要确保结果正确。

source: Figure 2-9 shows a session win‐ dow.
zh_cn: 图2-9展示了一个会话窗口。

source: Figure 2-5 shows a rolling minimum aggregation.
zh_cn: 图2-5展示了一个求最小值的滚动聚合，

source: Figure 3-7 show the same pipeline would be executed without task chaining.
zh_cn: 图3-7展示了同一个流水线如何非任务链接模式下执行。

source: The truth is that processing time can indeed be useful in some cases.
zh_cn: 事实上，处理时间在某些情况下确有其用，

source: Figure 2-13 shows that an event-time window would correctly place events in a window, reflecting the reality of how things happened, even though some events were delayed.
zh_cn: 如图2-13所示，即便事件有延迟，事件时间窗口也能准确地将事件分配到窗口中，从而反映出真实发生的情况。

source: Figure 2-2 shows a physical dataflow graph for the logical graph of Figure 2-1.
zh_cn: 图2-2展示了图2-1中逻辑图对应的物理dataflow图。

source: Figure 3-3 illustrates this design.
zh_cn: 图3-3阐明了这一设计。

source: Figure 3-4 visualizes this architecture.
zh_cn: 图3-4展示了这一架构，

source: Figure 2-6 shows a count-based tumbling window that discretizes the input stream into buckets of 4 elements.
zh_cn: 图2-6中基于数量的滚动窗口将输入流按每4个元素一组分配到不同的通中。

source: Figure 2-10 shows a parallel count-based tumbling window of length 2 which is partitioned by event color.
zh_cn: 图2-10展示了一个按事件颜色划分、基于数量2的并行滚动窗口。

source: Figure 2-7 shows a time-based tumbling window that gathers events into buckets and triggers computation every 10 minutes.
zh_cn: 图2-7中基于时间的滚动窗口将事件汇集到桶中，每10分钟触发一次计算。

source: Figure 1-2 depicts a microservice architecture.
zh_cn: 图1-2描绘了微服务的架构。

source: A Bit of History
zh_cn: 历史回顾

source: A CheckpointCommitter as discussed before
zh_cn: 一个之前介绍过的CheckpointCommitter

source: A DataStream does not have to eventually flow into a sink opera‐ tor.
zh_cn: 一个DataStream不必非要向数据汇算子写出数据流。

source: A FileInputFormat used in a DataStream application should also implement the CheckpointableInputFormat interface, which defines methods to checkpoint and reset the the current reading position of an InputFormat within a file split.
zh_cn: DataStream应用中所用到的FileInputFormat还需要实现CheckpointableInputFormat接口，该接口定义了生成检查点以及针对某个输入划分重置InputFormat中读取位置的相关方法。

source: A FileInputFormat, which is responsible for reading the content of the files.
zh_cn: 一个FileInputFormat对象，负责读数文件内容。

source: A FileSystem class implements file‐ system operations, such as reading from and writing to files, creating directories or
zh_cn: 每个FileSystem类都实现了文件系统的基本操作，包括读写文件、创建文件或目录，以及列出目录内容等。

source: A Flink DataStream application can assign timestamps and generate watermarks to a stream in three ways:
zh_cn: Flink DataStream应用可以通过三种方式分配时间戳和生成水位线：

source: A Flink HA setup requires a running Apache ZooKeeper cluster and a persistent remote storage, such as HDFS, NFS, or S3.
zh_cn: Flink的HA设置需要运行一个Apache ZooKeeper集群和一个持久化远程存储（例如HDFS、NFS或S3）。

source: A Flink Kafka consumer can be configured to automatically discover new topics that match the regular expression or new partitions that were added to a topic.
zh_cn: 我们可以通过配置让Flink Kafka消费者自动发现满足给定正则表达式的新主题或添加到主题中的新分区。

source: A Flink YARN session is started with the ./bin/yarn-session.sh script, which also uses various parameters to control the size of containers, the name of the YARN
zh_cn: 你可以通过./bin/yarn-session.sh脚本启动一个Flink YARN会话，该脚本同样设有很多用于控制容器大小及YARN应用名称或提供动态属性的参数。
